{
    "title": "Create Nonvirtual Buses",
    "introduction": "A nonvirtual bus is analogous to a structure in C code. Use nonvirtual buses to: A Simulink.Bus object data type must define the bus you want to make nonvirtual. A bus becomes nonvirtual when you select a block parameter such as Output as nonvirtual bus. Making the bus nonvirtual causes simulation and code generation to apply the structure defined by the bus object. When the bus is virtual, the bus object only validates the properties of the bus. To simulate a model that contains nonvirtual buses, the referenced bus objects must be in the base workspace or a data dictionary used by the model. For more information, see Specify Bus Properties with Bus Objects. Nonvirtual buses also require all elements of the bus to have the same sample time. For more information, see Modify Sample Times for Nonvirtual Buses. The way to create nonvirtual buses differs based on the location of the bus and the block that creates the bus: To focus on fundamental steps, the examples are simple. However, buses are most useful when you have many signals to combine.",
    "chunks": [
        {
            "heading": "Create Nonvirtual Buses Within Component",
            "content": "Open Live Script\n\nYou can use Bus Creator blocks to create nonvirtual buses within components.\n\nOpen and compile the model named BusHierarchy, which uses Bus Creator blocks to create a hierarchy of virtual buses. To compile the model, on the Modeling tab of the SimulinkÂ® Toolstrip, click Update Model or Run. Compiling the model updates the line styles, which you can use to visually identify buses.\n\nmdl = BusHierarchy; open_system(mdl) set_param(mdl,SimulationCommand=\"Update\")\n\nTo create this model, see Group Signal Lines Within Component.\n\nThe virtual buses in this model are not defined by Simulink.Bus objects. To change the output of the Bus Creator blocks to nonvirtual buses, you must have bus objects that match the bus hierarchy.\n\nTo create the bus objects that correspond to TopBus and NestedBus, use the Simulink.Bus.createObject function. In the MATLABÂ® Command Window, enter this command.\n\nSimulink.Bus.createObject(\"BusHierarchy\",\"BusHierarchy/Bus Creator1\");\n\nThis function creates the bus object that corresponds to the output bus of the specified block. If the output bus contains nested buses, the function also creates bus objects that correspond to the nested buses. In this example, the function creates two bus objects that are named after the corresponding buses, TopBus and NestedBus.\n\nTo view the bus objects, open the Type Editor. In the Simulink Toolstrip, on the Modeling tab, in the Design gallery, click Type Editor. To expand an external data source or bus, click the arrow next to its name.\n\nNow that you have bus objects that correspond to the nonvirtual buses you want to create, create the nonvirtual buses. In the Simulink Editor, double-click the Bus Creator block named Bus Creator1. In the Block Parameters dialog box, set Output data type to Bus: TopBus, select the Output as nonvirtual bus check box, and click OK. TopBus is now a nonvirtual bus, while NestedBus remains a virtual bus. To identify the nonvirtual bus by line style, compile the model.\n\nDouble-click the block named Bus Creator. In the Block Parameters dialog box, set Output data type to Bus: NestedBus, select the Output as nonvirtual bus check box, and click OK. NestedBus is now a nonvirtual bus. To update its line style, compile the model.\n\nIf you do not save the bus objects, then you must recreate the bus objects when you reopen the model. For information on how to save the bus objects, see Specify Bus Properties with Bus Objects."
        },
        {
            "heading": "Create Nonvirtual Buses at Interfaces",
            "content": "Open Live Script\n\nTo create a nonvirtual bus at an interface, connect the bus elements to Out Bus Element blocks and specify that the output bus is nonvirtual.\n\nOpen the model named BusOutput, which uses three Out Bus Element blocks to create a virtual bus at the output port.\n\nTo create this model, see Connect Multiple Output Signals to a Port.\n\nNonvirtual buses require a Simulink.Bus object data type. Create the bus object that corresponds to the output bus.\n\nIn the SimulinkÂ® Toolstrip, on the Modeling tab, in the Design gallery, select Type Editor.In the Type Editor, create bus objects named Interface and Sinusoidal.For each bus object, create the Simulink.BusElement objects that correspond to the elements of the buses. In Sinusoidal, create elements named Chirp and Sine. In Interface, create elements named NestedBus and Step.Specify a bus object data type for any nested buses. For NestedBus, set Data type to Bus: Sinusoidal.\n\nTo output a nonvirtual bus, specify the bus object data type and bus virtuality.\n\nOpen the dialog box for the port by double-clicking one of the Out Bus Element blocks.In the tree hierarchy of the dialog box, pause on OutBus. Then, click the pencil icon that appears next to OutBus.Specify the bus object data type. Set Data type to Bus: Interface.In the tree hierarchy of the dialog box, click the signal attributes that now appear next to OutBus.Specify the bus virtuality. Set Bus virtuality to nonvirtual.\n\nThe output of the model is a nonvirtual bus. To see the nonvirtual bus, reference the model in another model or move the Out Bus Element blocks into a subsystem. The line styles update when you compile the model. To compile the model, on the Modeling tab of the Simulink Toolstrip, click Update Model or Run.\n\nIf you do not save the bus objects, you must recreate the bus objects when you reopen the model. For information on how to save the bus objects, see Specify Bus Properties with Bus Objects.\n\nIn Bus Element blocks use the Bus virtuality parameter to determine whether they inherit or define the bus virtuality. If the block defines the bus virtuality and the virtuality of the input bus does not match, compiling the model produces an error.\n\nRoot Inport and Outport blocks can also create nonvirtual buses at interfaces. To specify the bus virtuality:\n\nFor a root Inport block, on the Signal Attributes tab of the dialog box, select Output as nonvirtual bus.For a root Outport block, on the Signal Attributes tab of the dialog box, select Output as nonvirtual bus in parent model."
        },
        {
            "heading": "Convert Virtual Bus to Nonvirtual Bus",
            "content": "Open Live Script\n\nYou can convert a virtual bus to a nonvirtual bus anywhere within a model by using a Signal Conversion block.\n\nOpen and compile the model named BusConversion, which contains a virtual bus hierarchy created by Bus Creator blocks. To compile the model, on the Modeling tab of the Simulink Toolstrip, click Update Model or Run. Compiling the model updates the line styles, which you can use to visually identify buses.\n\nTo define the buses and support conversion to nonvirtual buses, the Bus Creator blocks specify Simulink.Bus object data types. To create the bus objects in the base workspace when the model is loaded, the model uses the PreLoadFcn callback.\n\nTo view the callback, in the Simulink Toolstrip, on the Modeling tab, click Model Settings > Model Properties. In the Model Properties dialog box, open the Callbacks tab and select the PreLoadFcn model callback.\n\nTo view the bus objects, open the Type Editor.\n\nTo convert a virtual bus to a nonvirtual bus, use a To Nonvirtual Bus block, which is a preconfigured version of the Signal Conversion block that has Output set to Nonvirtual bus.\n\nIn the example model:\n\nAdd a To Nonvirtual Bus block to the model.Drag the To Nonvirtual Bus block onto the line between the Bus Creator block named Bus Creator1 and the Scope block. When you drag the block onto the line, the block connects to the line at both ends.\n\nSuppose the data type of the bus you want to convert is not specified by a bus object. You would need to perform these additional actions:\n\nCreate the corresponding bus objects.Specify the bus object data type for the bus. For example, set the Data type parameter of the To Nonvirtual Bus block to the bus object that corresponds to the input bus.\n\nThe input to the To Nonvirtual Bus block is a virtual bus, and the output is a nonvirtual bus. To see the nonvirtual bus line style, compile the model."
        },
        {
            "heading": "Create Nonvirtual Bus from MATLAB Structure",
            "content": "Open Live Script\n\nYou can use a Constant block to compactly represent a nonvirtual bus with constant-valued elements.\n\nOn the Constant block, specify:\n\nA MATLAB structure for Constant value.A Simulink.Bus object as the Output data type.\n\nConstant blocks only support MATLAB structures when the output data type is a Bus object.\n\nFor example, define a MATLAB structure named const_param_struct with elements named Offset, Gain, and Threshold.\n\nconst_param_struct.Offset = 197; const_param_struct.Gain = 4.32; const_param_struct.Threshold = 795.68;\n\nDefine the corresponding Bus object data type.\n\nSimulink.Bus.createObject(const_param_struct)\n\nThe new Bus object uses the default name slBus1.\n\nOpen and simulate the example model, which contains a Constant block with Constant value set to const_param_struct and Output data type set to Bus: slBus1.\n\nopen_system('NonvirtualBusFromStructModel') sim('NonvirtualBusFromStructModel');\n\nThe output of the Constant block is a nonvirtual bus."
        },
        {
            "heading": "Blocks",
            "content": "• Bus Creator"
        },
        {
            "heading": "Objects",
            "content": "• Simulink.Bus\n\n• Composite Interface Guidelines\n• Programmatically Create Bus Element Ports\n• Specify Bus Properties with Bus Objects\n• Modify Sample Times for Nonvirtual Buses\n• Inspect Generated Code for Nonvirtual Buses\n• Create Structures in MATLAB Function Blocks"
        }
    ],
    "link": "https://in.mathworks.com/help/simulink/ug/create-nonvirtual-buses.html#mw_4bc621b4-576a-46c5-afe9-b43e8bcd16dd",
    "images": [
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusesWithinAComponentExample_01.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusesWithinAComponentExample_02.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusesWithinAComponentExample_03.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusesWithinAComponentExample_04.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusAtInterfaceExample_01.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusAtInterfaceExample_02.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusAtInterfaceExample_03.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusAtInterfaceExample_04.png",
        "https://in.mathworks.com/help/examples/simulink/win64/ConvertVirtualBusToNonvirtualBusExample_01.png",
        "https://in.mathworks.com/help/examples/simulink/win64/ConvertVirtualBusToNonvirtualBusExample_02.png",
        "https://in.mathworks.com/help/examples/simulink/win64/ConvertVirtualBusToNonvirtualBusExample_03.png",
        "https://in.mathworks.com/help/examples/simulink/win64/CreateNonvirtualBusFromStructureExample_01.png"
    ]
}