{
    "title": "Keyboard Shortcuts and Mouse Actions for Simulink Modeling",
    "introduction": "You can use keyboard shortcuts and mouse actions to model systems in Simulink®. To open this page from a model, press Shift+? or click Keyboard Shortcuts on the navigation bar.",
    "chunks": [
        {
            "heading": "View Keyboard Shortcuts in Editor",
            "content": "When you are in any of these modes, you can view a hints panel that displays keyboard shortcuts specific to the active mode.\n\nModeDefinitionHow to Enter ModeHow to View Hints PanelKeyboard SelectionUse the arrow keys to select a different block.Select a block in your model. Press M to switch from movement mode (the default) to selection mode.The hints panel appears when you enter selection mode.MovementMove a block by dragging it with the pointer.Drag a block with the pointer.The hints panel appears when you enter movement mode.Keyboard MovementUse the arrow keys to move the selected block.When you open Simulink, you are in movement mode by default. To switch from selection mode to movement mode, press M.The hints panel appears when you use the arrow keys to move a selected block.Signal tracingTrace the signal line to the signal source or destination. See Highlight Signal Sources and Destinations for details.Click a signal in your model. Pause on the ellipsis that appears. In the action bar that expands, click either Highlight Signal to Source or Highlight Signal to Destination .The hints panel appears when you enter signal tracing mode.Pan and zoomPan to move the view over the model. Zoom to change how close the model appears.When you open Simulink, you are in pan and zoom mode by default. Press the space bar until the hints panel expands. If the hints panel is minimized, press the space bar until the ? button appears. To hide the hints panel, click the canvas.ResizeChange the size of a block.Pause on a block resize handle.The hints panel appears when you enter resize mode.\n\nTo minimize the hints panel, press ? on your keyboard. When the hints panel is minimized, only the ? button is visible.\n\nTo restore the hints panel, press ? on your keyboard.\n\nMinimizing or restoring a hints panel in one mode does not affect the hints panels of other modes. Expanded hints panels remain expanded and minimized hints panels remain minimized across MATLAB® sessions.\n\nFor example, to see the Keyboard Selection hints panel for selection mode:\n\nSelect a block in your model. Press M. The minimized hints panel appears in the lower right of the model window.To restore the hints panel, press ? on your keyboard."
        },
        {
            "heading": "Perform File and Clipboard Actions",
            "content": "TaskShortcutsOpen modelCtrl+OCreate modelCtrl+NPrint modelCtrl+PSave all modified models in current model hierarchyCtrl+SSave current referenced modelCtrl+Shift+SClose modelCtrl+WCutCtrl+XCopyCtrl+CPasteCtrl+VUndoCtrl+ZRedoCtrl+Y, Ctrl+Shift+Z (Simulink Online™)Find search stringCtrl+F"
        },
        {
            "heading": "Zoom and Pan",
            "content": "TaskShortcuts and ActionsFit diagram to windowSpace barFit selection to windowSpace bar + FZoom inCtrl+Plus (+) or space bar + Plus (+)Zoom outCtrl+Minus (-) or space bar + Minus (-)Zoom to 100%Ctrl+0, Alt+1, or space bar + 0Zoom with scroll wheelScroll wheelCtrl + scroll wheel when Scroll wheel controls zooming is clearedZoom in on model elementDrag the Zoom button from the palette to the element.View portion of block diagram visible in model window relative to full block diagram with miniature mapZoom or pan to part of the model.When only part of the model is visible, press the space bar until the miniature map appears.View different portion of modelClick the destination in the miniature map.PanDrag the highlighted area in the miniature map.Drag with middle button.Space bar + drag.When a scroll bar is shown, to move the scroll bar with your keyboard, press Space bar + left, right, up, or down arrow.Pan verticallyCtrl + scroll wheelPan horizontallyShift + scroll wheelPan by pageShift + space bar + left, right, up, or down arrow"
        },
        {
            "heading": "Navigate Model",
            "content": "TaskShortcuts and ActionsOpen modelDouble-click.EnterChange tabsCtrl+Shift+TabEnter selected subsystem, referenced model, or Stateflow® chartEnterGo to parent of selected subsystem, referenced model, or Stateflow chartEscGo to last viewed component in model hierarchy navigation historyCtrl+[Go to next viewed component in model hierarchy navigation historyCtrl+]Look under block maskCtrl+UFor linked blocks, go to library of parent blockCtrl+LOpen the Model ExplorerCtrl+H"
        },
        {
            "heading": "Select and Move Model Elements",
            "content": "Selected elements have a solid blue outline. The most recently selected element has blue corner brackets in addition to the outline. To represent the cursor when you use the keyboard for selection, a blue box with dashed lines surrounds the element.\n\nBy default, the model is in movement mode. To switch to selection mode, press M.\n\nTaskShortcuts and ActionsToggle between movement and selection modeMSelect all blocks, lines, and annotationsCtrl+AClear selectionCtrl+Alt+ASelect one or more model elementsDraw a selection box around the model elements you want to select. Start the selection box on an empty spot on the canvas.Move any model element, including signal labelsDrag element.Move selected elementsDrag one of the selected elements.Drag selection box.After selecting elements with the keyboard, in selection mode, press the left, right, up, or down arrow.By default, when you move or resize a block with three or more ports, the shape of signal lines connecting to blocks with one or two ports does not change. Instead, the connected blocks move.Turn the functionality off.Hold the space bar while you move or resize a block.When you release the space bar, the functionality turns back on.Change selection to closest similar element in a directionIn selection mode, press the left, right, up, or down arrow.Move cursor to closest element in a direction, regardless of similarityIn selection mode, press Ctrl+Shift + left, right, up, or down arrow.Change selection to element at top-left of canvasCtrl+HomeOn macOS, press home.Change selection to element at bottom-right of canvasCtrl+EndOn macOS, press end.Change selection to leftmost element relative to cursorHomeOn macOS, press control+left.Change selection to rightmost element relative to cursorEndOn macOS, press control+right.Select additional adjacent elementsTo select additional adjacent elements with the keyboard, in selection mode, press Shift + left, right, up, or down arrow.To select additional adjacent elements with the pointer, press Shift while dragging a selection box around the additional elements.Select additional elements that are not adjacentTo select additional elements with the keyboard, in selection mode, press Ctrl + left, right, up, or down arrow and navigate to the element you want to select. Then, add the element to the selection by pressing Ctrl + space bar.On macOS, to add the current element to the selection, press command+shift + space bar or shift + space bar.To select additional elements with the pointer, press Shift and click.Constrain movement of model elements to vertical and horizontal directionsStart dragging the element, then press Shift."
        },
        {
            "heading": "Add and Edit Model Elements",
            "content": "TaskShortcuts and ActionsOpen or hide the Property InspectorCtrl+Shift+IOn macOS, press command+option+O.Before R2023b: On macOS, press command+shift+I.Open or hide the Component Interface ViewCtrl+Shift+V (since R2024b)Open or hide the Type EditorCtrl+Shift+P (since R2023b)Set main parameter for selected blockAlt+EnterAdd block to model at current location with the quick insert menuDouble-click the Simulink Editor canvas and start typing the block name, then select the block from the menu.Ctrl+Period (.) twice and start typing the block name, then press the down arrow to select the block from the list and press Enter to insert the block.On AZERTY keyboards, press Ctrl+Shift+Period (.) instead of Ctrl+Period (.).Choose block to connect to signal lineMove your pointer over the unconnected end of a signal line. When your pointer is over the end of the signal line, it becomes a circle. Double-click the end of the signal line. Using the quick insert menu that appears, add a block. The new block is connected to the end of the signal line that you double-clicked.For information about how to use the quick insert menu, see Add Blocks to Models Using Quick Insert Menu.Open the Library BrowserCtrl+Shift+LAdd annotation to model at current location with the quick insert menuDouble-click the Simulink Editor canvas and type the annotation content, then select the annotation option.Ctrl+Period (.) twice and type the annotation content, then press the down arrow to select the annotation option and press Enter to insert the annotation.On AZERTY keyboards, press Ctrl+Shift+Period (.) instead of Ctrl+Period (.).Copy selected model elementsDrag elements with the right mouse button.Ctrl + drag.Copy selected model elements between Simulink Editor windowsDrag elements between windows.Delete selected model elementsDelete or Backspace"
        },
        {
            "heading": "Connect Model Elements",
            "content": "TaskShortcuts and ActionsConnect blocks with signal linesClick a port. Click the blue chevron symbol that appears near a compatible port you want to connect to.Select the first block, then Ctrl + click a second block.Drag from port to port.Click a port and press Shift as you connect to the next port. Press Shift to make multiple, consecutive connections.Branch signal lineClick a port, move the cursor near the line you want to branch, and then click after you see the preview.Select a line, move the cursor toward the element you want to connect with, and then click the blue chevron symbol that appears near the port.Ctrl + drag line.Right mouse button + drag.Add ports to blocks that take multiple inputsDrag toward the port from a compatible block or signal line.Drag from the edge of the block that you want to add the port to.Click the edge of the port, and then drag.Click the edge of the port, move the cursor over the signal type — signal, bus, or connector — from the menu, and drag.Disconnect selected blocksPress Shift, then drag block.After selecting blocks with the keyboard, press M then Shift + left, right, up, or down arrow.Comment through selected blocksCtrl+Shift+YComment out or uncomment selected blocksCtrl+Shift+X"
        },
        {
            "heading": "Name Model Elements",
            "content": "TaskShortcuts and ActionsRename selected model elementClick or double-click the label.Select the element and press F2.On macOS, press command+return instead of F2.Name signal lineDouble-click the signal and type its name.Display name on branch of a named signal lineDouble-click the branch.Name every branch of a signal lineRight-click the signal, select Properties, and use the Signal Properties dialog box.Delete signal label and nameDelete characters in the label, or delete the name in Signal Properties dialog box.Delete signal label only Right-click the label and select Delete Label.Copy signal labelCtrl + drag the signal label.Edit port labels on subsystem blocksPoint to the port label and click the interactive cue (blue box surrounding the label).Select the port. Click the port label cue or press F2. To switch between block name and signal name when editing labels on signal ports, press Ctrl+1,2.To make successive port label edits on a subsystem block: Select a port on the block, edit the label, and press Enter. This action enables keyboard selection of ports.Use up or down arrow keys to select adjacent ports and press F2 for quick editing."
        },
        {
            "heading": "Format Block Diagram",
            "content": "TaskShortcuts and ActionsAutomatically arrange modelCtrl+Shift+AResize block, maintaining ratio of width and heightShift + drag handleResize block about the centerCtrl + drag handleRoute lines around blocksShift + drag while drawingRotate blocks clockwiseCtrl+RRotate blocks counterclockwiseCtrl+Shift+RFlip blocksCtrl+ICreate subsystem from selectionCtrl+GCreate subsystem or area from empty selectionTo create the highlighted option, which you can change by using the arrow keys or mouse:Click inside the selection box.Press Enter.Press the number key associated with an option.Change signal label fontSelect the signal line (not the label), then on the Format tab, click the Font Properties button arrow, then click Fonts for Model.Mask blockCtrl+MRefresh Model blocksCtrl+K"
        },
        {
            "heading": "Perform Generic Actions",
            "content": "TaskShortcuts and ActionsPerform generic action with the quick action search menuDouble-click the Simulink Editor canvas, select the Actions tab, and start typing the action name or description, then select the action from the list.Ctrl+Period (.) and start typing the action name or description, then press the down arrow to select the action and press Enter to perform it.On AZERTY keyboards, press Ctrl+Shift+Period (.) instead of Ctrl+Period (.).Perform context-sensitive actionBefore opening the quick action search menu, select a model element."
        },
        {
            "heading": "Simulate, Update, and Generate Code for Models",
            "content": "TaskShortcutsStart simulationCtrl+T or F5Stop simulationCtrl+Shift+TUpdate modelCtrl+DOpen Configuration Parameters dialog boxCtrl+EBuild model (for code generation)Ctrl+B"
        },
        {
            "heading": "Debug Simulations",
            "content": "Since R2023b\n\nThe keyboard shortcuts in the table are the same in the Simulink Editor, the Stateflow Editor, and the MATLAB Function Block Editor.\n\nTaskShortcutsStep overF10On macOS, press shift+command+O.Step inF11On macOS, press shift+command+I.Step outShift+F11On macOS, press shift+command+U."
        }
    ],
    "link": "https://in.mathworks.com/help/simulink/ug/summary-of-mouse-and-keyboard-actions.html",
    "images": [
        "https://in.mathworks.com/help/simulink/ug/keyboard_shortcuts_button.png",
        "https://in.mathworks.com/help/simulink/ug/highlight-signal-to-source-button.png",
        "https://in.mathworks.com/help/simulink/ug/highlight-source-to-destination-button.png",
        "https://in.mathworks.com/help/simulink/ug/question-mark-button.png",
        "https://in.mathworks.com/help/simulink/ug/question-mark-button.png",
        "https://in.mathworks.com/help/simulink/ug/keyboard-cheat-sheet-keyboard-selection.png",
        "https://in.mathworks.com/help/simulink/ug/editor_zoom_button.png",
        "https://in.mathworks.com/help/simulink/ug/keyboard_selection_cursor.png",
        "https://in.mathworks.com/help/simulink/ug/21a_porthint_symbol.png",
        "https://in.mathworks.com/help/simulink/ug/21a_porthint_symbol.png"
    ]
}